node {
  name: "input_tensor"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "class_input_label"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "net_phase"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "ArgMax/dimension"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "ArgMax"
  op: "ArgMax"
  input: "class_input_label"
  input: "ArgMax/dimension"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "output_type"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\003\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.18618986010551453
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/TruncatedNormal"
  input: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal"
  op: "Add"
  input: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/mul"
  input: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/conv1/conv/W"
  input: "40X_64S_model/inference/conv1/conv/W/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/W/read"
  op: "Identity"
  input: "40X_64S_model/inference/conv1/conv/W"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/b/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/b"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/b"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/b"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/b/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/conv1/conv/b"
  input: "40X_64S_model/inference/conv1/conv/b/Initializer/Const"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/b"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/b/read"
  op: "Identity"
  input: "40X_64S_model/inference/conv1/conv/b"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv1/conv/b"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/Conv2D"
  op: "Conv2D"
  input: "input_tensor"
  input: "40X_64S_model/inference/conv1/conv/W/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/BiasAdd"
  op: "BiasAdd"
  input: "40X_64S_model/inference/conv1/conv/Conv2D"
  input: "40X_64S_model/inference/conv1/conv/b/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/conv/conv"
  op: "Identity"
  input: "40X_64S_model/inference/conv1/conv/BiasAdd"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/conv1/relu"
  op: "Relu"
  input: "40X_64S_model/inference/conv1/conv/conv"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/pool1"
  op: "MaxPool"
  input: "40X_64S_model/inference/conv1/relu"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000@\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.040311288088560104
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/TruncatedNormal"
  input: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal"
  op: "Add"
  input: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/mul"
  input: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 64
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/conv2/conv/W"
  input: "40X_64S_model/inference/conv2/conv/W/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/W/read"
  op: "Identity"
  input: "40X_64S_model/inference/conv2/conv/W"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/b/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/b"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/b"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/b"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/b/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/conv2/conv/b"
  input: "40X_64S_model/inference/conv2/conv/b/Initializer/Const"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/b"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/b/read"
  op: "Identity"
  input: "40X_64S_model/inference/conv2/conv/b"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv2/conv/b"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/Conv2D"
  op: "Conv2D"
  input: "40X_64S_model/inference/pool1"
  input: "40X_64S_model/inference/conv2/conv/W/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/BiasAdd"
  op: "BiasAdd"
  input: "40X_64S_model/inference/conv2/conv/Conv2D"
  input: "40X_64S_model/inference/conv2/conv/b/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/conv/conv"
  op: "Identity"
  input: "40X_64S_model/inference/conv2/conv/BiasAdd"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/conv2/relu"
  op: "Relu"
  input: "40X_64S_model/inference/conv2/conv/conv"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/pool2"
  op: "AvgPool"
  input: "40X_64S_model/inference/conv2/relu"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0570087730884552
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/TruncatedNormal"
  input: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal"
  op: "Add"
  input: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/mul"
  input: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/conv3/conv/W"
  input: "40X_64S_model/inference/conv3/conv/W/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/W/read"
  op: "Identity"
  input: "40X_64S_model/inference/conv3/conv/W"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/W"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/b/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/b"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/b"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/b"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/b/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/conv3/conv/b"
  input: "40X_64S_model/inference/conv3/conv/b/Initializer/Const"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/b"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/b/read"
  op: "Identity"
  input: "40X_64S_model/inference/conv3/conv/b"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/conv3/conv/b"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/Conv2D"
  op: "Conv2D"
  input: "40X_64S_model/inference/pool2"
  input: "40X_64S_model/inference/conv3/conv/W/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/BiasAdd"
  op: "BiasAdd"
  input: "40X_64S_model/inference/conv3/conv/Conv2D"
  input: "40X_64S_model/inference/conv3/conv/b/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/conv/conv"
  op: "Identity"
  input: "40X_64S_model/inference/conv3/conv/BiasAdd"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/conv3/relu"
  op: "Relu"
  input: "40X_64S_model/inference/conv3/conv/conv"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/pool2_1"
  op: "AvgPool"
  input: "40X_64S_model/inference/conv3/relu"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/Reshape/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377@\014\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/Reshape"
  op: "Reshape"
  input: "40X_64S_model/inference/pool2_1"
  input: "40X_64S_model/inference/fc1/Reshape/shape"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\014\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.028793778270483017
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/mul"
  input: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3136
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/fc1/fc/kernel"
  input: "40X_64S_model/inference/fc1/fc/kernel/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/kernel/read"
  op: "Identity"
  input: "40X_64S_model/inference/fc1/fc/kernel"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc1/fc/kernel"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/MatMul"
  op: "MatMul"
  input: "40X_64S_model/inference/fc1/Reshape"
  input: "40X_64S_model/inference/fc1/fc/kernel/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/fc/output"
  op: "Identity"
  input: "40X_64S_model/inference/fc1/fc/MatMul"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/fc1/relu"
  op: "Relu"
  input: "40X_64S_model/inference/fc1/fc/output"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/Reshape/shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377@\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/Reshape"
  op: "Reshape"
  input: "40X_64S_model/inference/fc1/relu"
  input: "40X_64S_model/inference/Reshape/shape"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20155644416809082
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/TruncatedNormal"
  input: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal"
  op: "Add"
  input: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/mul"
  input: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel"
  op: "VariableV2"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/Assign"
  op: "Assign"
  input: "40X_64S_model/inference/fc2/kernel"
  input: "40X_64S_model/inference/fc2/kernel/Initializer/truncated_normal"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/kernel/read"
  op: "Identity"
  input: "40X_64S_model/inference/fc2/kernel"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@40X_64S_model/inference/fc2/kernel"
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/MatMul"
  op: "MatMul"
  input: "40X_64S_model/inference/Reshape"
  input: "40X_64S_model/inference/fc2/kernel/read"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "40X_64S_model/inference/fc2/output"
  op: "Identity"
  input: "40X_64S_model/inference/fc2/MatMul"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/softmax"
  op: "Softmax"
  input: "40X_64S_model/inference/fc2/output"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/inference/score/dimension"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "40X_64S_model/inference/score"
  op: "ArgMax"
  input: "40X_64S_model/inference/softmax"
  input: "40X_64S_model/inference/score/dimension"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "output_type"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/labels_stop_gradient"
  op: "StopGradient"
  input: "class_input_label"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Rank"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Rank_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Shape_1"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub/y"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub"
  op: "Sub"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Rank_1"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub/y"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice/begin"
  op: "Pack"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice/size"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice"
  op: "Slice"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Shape_1"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice/begin"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice/size"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat/values_0"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat/axis"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat"
  op: "ConcatV2"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat/values_0"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat/axis"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Reshape"
  op: "Reshape"
  input: "40X_64S_model/inference/fc2/output"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Rank_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Shape_2"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub_1/y"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub_1"
  op: "Sub"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Rank_2"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub_1/y"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice_1/begin"
  op: "Pack"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub_1"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice_1/size"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice_1"
  op: "Slice"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Shape_2"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice_1/begin"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice_1/size"
  device: "/device:GPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat_1/values_0"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat_1/axis"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat_1"
  op: "ConcatV2"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat_1/values_0"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Slice_1"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat_1/axis"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Reshape_1"
  op: "Reshape"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/labels_stop_gradient"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/concat_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg"
  op: "SoftmaxCrossEntropyWithLogits"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Reshape"
  input: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Reshape_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "40X_64S_model/softmax_cross_entropy_with_logits_sg/Sub_2/y"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
